# Core dev tools
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gh"
brew "lazygit"
brew "mise"
brew "neovim"
brew "jq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "zoxide"
brew "ast-grep"
brew "tree"
brew "coreutils"
brew "fastfetch"
brew "btop"
brew "yazi"
brew "tmux"
brew "sk"
brew "todo-txt"

# Shell
brew "fish"
brew "atuin"
brew "starship"

# DB clients (servers run in Docker)
brew "libpq"
brew "pgcli"

# Container runtime
cask "orbstack"

# Editors & terminals
cask "ghostty"
cask "zed@preview"

# Browsers
cask "google-chrome"
cask "google-chrome-canary"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"

# Apps
cask "raycast"
cask "tableplus"
# cask "1password"
