# --- Git ---
brew "git"                         # version control
brew "git-delta"                   # better diff viewer with syntax highlighting
brew "git-lfs"                     # large file storage for git
brew "gh"                          # GitHub CLI for PRs, issues, etc.
brew "lazygit"                     # terminal UI for git

# --- Editors ---
brew "neovim"                      # terminal editor, used as git commit editor
cask "zed@preview"                 # primary GUI editor
cask "ghostty"                     # GPU-accelerated terminal emulator

# --- Shell ---
brew "fish"                        # friendly interactive shell
brew "atuin"                       # shell history sync and search (replaces ctrl-r)
brew "starship"                    # cross-shell prompt with git/lang info
brew "tmux"                        # terminal multiplexer for persistent sessions

# --- Search & navigation ---
brew "ripgrep"                     # fast recursive grep (rg)
brew "fd"                          # fast find alternative
brew "fzf"                         # fuzzy finder for files, history, etc.
brew "sk"                          # skim — fuzzy finder used by tmux-sessionizer
brew "zoxide"                      # smarter cd that learns your frequent dirs
brew "ast-grep"                    # structural code search using AST patterns

# --- File viewers & system info ---
brew "bat"                         # cat with syntax highlighting and line numbers
brew "eza"                         # modern ls replacement with git integration
brew "tree"                        # directory tree viewer
brew "yazi"                        # terminal file manager with image preview
brew "fastfetch"                   # system info summary
brew "btop"                        # terminal system monitor (cpu, mem, disk, net)

# --- Dev tools ---
brew "mise"                        # runtime version manager (node, go, python, etc.)
brew "jq"                          # JSON processor for the command line
brew "coreutils"                   # GNU utils (gdate, etc.) needed for calendar functions
brew "todo-txt"                    # plain-text task manager

# --- Database clients (servers run in Docker) ---
brew "libpq"                       # PostgreSQL client libraries (psql)
brew "pgcli"                       # PostgreSQL CLI with autocomplete and syntax highlighting

# --- Containers ---
cask "orbstack"                    # lightweight Docker & Linux VM runtime for macOS

# --- Browsers ---
cask "google-chrome"
cask "google-chrome@canary"

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"  # primary terminal/editor font with icon glyphs
cask "font-hack-nerd-font"            # zed terminal font (Hack Nerd Font Propo)
cask "font-maple-mono-nf-cn"          # zed buffer font (Maple Mono NF CN)
cask "font-monaspace"                 # variable-width coding font family by GitHub

# --- Apps ---
cask "raycast"                     # Spotlight replacement with extensions and snippets
cask "tableplus"                   # GUI database client
cask "1password"                   # password manager
